planets/app/controllers/planets_controller.rb

  def random
    @planets = Planet.all
    @planet = Planet.find(rand(1..@planets.length))
---
SELECT  "planets".* FROM "planets" ORDER BY RAND() LIMIT $1  [["LIMIT", 1]]
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @planet = Planet.find(params[:id])
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @planet = Planet.new(planet_params)
    @planet.name.downcase!
    if @planet.save
---
INSERT INTO "planets" ("name", "num_moons", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new planet"], ["num_moons", 2], ["color", "gray"], ["created_at", "2019-08-04 01:24:33.875677"], ["updated_at", "2019-08-04 01:24:33.875677"]]

  def destroy
    @planet = Planet.find(params[:id])
    @planet.destroy
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = $1  [["id", 7]]

  def edit
    @planet = Planet.find(params[:id])
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @planet = Planet.find(params[:id])
    if @planet.update_attributes(planet_params)
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "planets" SET "num_moons" = $1, "updated_at" = $2 WHERE "planets"."id" = $3  [["num_moons", 16], ["updated_at", "2019-08-04 01:13:58.865204"], ["id", 4]]